trol73/avr-make/asm/include/ATxmega64D4def.inc
; TC1_CTRLB masks
.equ TC1_CCDEN_bm = 0x80 ; Compare or Capture D Enable bit mask
.equ TC1_CCDEN_bp = 7 ; Compare or Capture D Enable bit position
.equ TC1_CCCEN_bm = 0x40 ; Compare or Capture C Enable bit mask
.equ TC1_CCCEN_bp = 6 ; Compare or Capture C Enable bit position
.equ TC1_CCBEN_bm = 0x20 ; Compare or Capture B Enable bit mask
.equ TC1_CCBEN_bp = 5 ; Compare or Capture B Enable bit position
.equ TC1_CCAEN_bm = 0x10 ; Compare or Capture A Enable bit mask
.equ TC1_CCAEN_bp = 4 ; Compare or Capture A Enable bit position
.equ TC1_WGMODE_gm = 0x07 ; Waveform generation mode group mask
.equ TC1_WGMODE_gp = 0 ; Waveform generation mode group position
.equ TC1_WGMODE0_bm = (1<<0) ; Waveform generation mode bit 0 mask
.equ TC1_WGMODE0_bp = 0 ; Waveform generation mode bit 0 position
.equ TC1_WGMODE1_bm = (1<<1) ; Waveform generation mode bit 1 mask
.equ TC1_WGMODE1_bp = 1 ; Waveform generation mode bit 1 position
.equ TC1_WGMODE2_bm = (1<<2) ; Waveform generation mode bit 2 mask
.equ TC1_WGMODE2_bp = 2 ; Waveform generation mode bit 2 position

; TC1_CTRLC masks
.equ TC1_CMPB_bm = 0x02 ; Compare B Output Value bit mask
.equ TC1_CMPB_bp = 1 ; Compare B Output Value bit position
.equ TC1_CMPA_bm = 0x01 ; Compare A Output Value bit mask
.equ TC1_CMPA_bp = 0 ; Compare A Output Value bit position

; TC1_CTRLD masks
.equ TC1_EVACT_gm = 0xE0 ; Event Action group mask
.equ TC1_EVACT_gp = 5 ; Event Action group position
.equ TC1_EVACT0_bm = (1<<5) ; Event Action bit 0 mask
.equ TC1_EVACT0_bp = 5 ; Event Action bit 0 position
.equ TC1_EVACT1_bm = (1<<6) ; Event Action bit 1 mask
.equ TC1_EVACT1_bp = 6 ; Event Action bit 1 position
.equ TC1_EVACT2_bm = (1<<7) ; Event Action bit 2 mask
.equ TC1_EVACT2_bp = 7 ; Event Action bit 2 position
.equ TC1_EVDLY_bm = 0x10 ; Event Delay bit mask
.equ TC1_EVDLY_bp = 4 ; Event Delay bit position
.equ TC1_EVSEL_gm = 0x0F ; Event Source Select group mask
.equ TC1_EVSEL_gp = 0 ; Event Source Select group position
.equ TC1_EVSEL0_bm = (1<<0) ; Event Source Select bit 0 mask
.equ TC1_EVSEL0_bp = 0 ; Event Source Select bit 0 position
.equ TC1_EVSEL1_bm = (1<<1) ; Event Source Select bit 1 mask
.equ TC1_EVSEL1_bp = 1 ; Event Source Select bit 1 position
.equ TC1_EVSEL2_bm = (1<<2) ; Event Source Select bit 2 mask
.equ TC1_EVSEL2_bp = 2 ; Event Source Select bit 2 position
.equ TC1_EVSEL3_bm = (1<<3) ; Event Source Select bit 3 mask
.equ TC1_EVSEL3_bp = 3 ; Event Source Select bit 3 position

; TC1_CTRLE masks
.equ TC1_BYTEM_bm = 0x01 ; Byte Mode bit mask
.equ TC1_BYTEM_bp = 0 ; Byte Mode bit position

; TC1_INTCTRLA masks
.equ TC1_ERRINTLVL_gm = 0x0C ; Error Interrupt Level group mask
.equ TC1_ERRINTLVL_gp = 2 ; Error Interrupt Level group position
.equ TC1_ERRINTLVL0_bm = (1<<2) ; Error Interrupt Level bit 0 mask
.equ TC1_ERRINTLVL0_bp = 2 ; Error Interrupt Level bit 0 position
.equ TC1_ERRINTLVL1_bm = (1<<3) ; Error Interrupt Level bit 1 mask
.equ TC1_ERRINTLVL1_bp = 3 ; Error Interrupt Level bit 1 position
.equ TC1_OVFINTLVL_gm = 0x03 ; Overflow interrupt level group mask
.equ TC1_OVFINTLVL_gp = 0 ; Overflow interrupt level group position
.equ TC1_OVFINTLVL0_bm = (1<<0) ; Overflow interrupt level bit 0 mask
.equ TC1_OVFINTLVL0_bp = 0 ; Overflow interrupt level bit 0 position
.equ TC1_OVFINTLVL1_bm = (1<<1) ; Overflow interrupt level bit 1 mask
.equ TC1_OVFINTLVL1_bp = 1 ; Overflow interrupt level bit 1 position

; TC1_INTCTRLB masks
.equ TC1_CCBINTLVL_gm = 0x0C ; Compare or Capture B Interrupt Level group mask
.equ TC1_CCBINTLVL_gp = 2 ; Compare or Capture B Interrupt Level group position
.equ TC1_CCBINTLVL0_bm = (1<<2) ; Compare or Capture B Interrupt Level bit 0 mask
.equ TC1_CCBINTLVL0_bp = 2 ; Compare or Capture B Interrupt Level bit 0 position
.equ TC1_CCBINTLVL1_bm = (1<<3) ; Compare or Capture B Interrupt Level bit 1 mask
.equ TC1_CCBINTLVL1_bp = 3 ; Compare or Capture B Interrupt Level bit 1 position
.equ TC1_CCAINTLVL_gm = 0x03 ; Compare or Capture A Interrupt Level group mask
.equ TC1_CCAINTLVL_gp = 0 ; Compare or Capture A Interrupt Level group position
.equ TC1_CCAINTLVL0_bm = (1<<0) ; Compare or Capture A Interrupt Level bit 0 mask
.equ TC1_CCAINTLVL0_bp = 0 ; Compare or Capture A Interrupt Level bit 0 position
.equ TC1_CCAINTLVL1_bm = (1<<1) ; Compare or Capture A Interrupt Level bit 1 mask
.equ TC1_CCAINTLVL1_bp = 1 ; Compare or Capture A Interrupt Level bit 1 position

; TC1_CTRLFCLR masks
.equ TC1_CMD_gm = 0x0C ; Command group mask
.equ TC1_CMD_gp = 2 ; Command group position
.equ TC1_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC1_CMD0_bp = 2 ; Command bit 0 position
.equ TC1_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC1_CMD1_bp = 3 ; Command bit 1 position
.equ TC1_LUPD_bm = 0x02 ; Lock Update bit mask
.equ TC1_LUPD_bp = 1 ; Lock Update bit position
.equ TC1_DIR_bm = 0x01 ; Direction bit mask
.equ TC1_DIR_bp = 0 ; Direction bit position

; TC1_CTRLFSET masks
; Masks for CMD aready defined
; Masks for LUPD aready defined
; Masks for DIR aready defined

; TC1_CTRLGCLR masks
.equ TC1_CCBBV_bm = 0x04 ; Compare or Capture B Buffer Valid bit mask
.equ TC1_CCBBV_bp = 2 ; Compare or Capture B Buffer Valid bit position
.equ TC1_CCABV_bm = 0x02 ; Compare or Capture A Buffer Valid bit mask
.equ TC1_CCABV_bp = 1 ; Compare or Capture A Buffer Valid bit position
.equ TC1_PERBV_bm = 0x01 ; Period Buffer Valid bit mask
.equ TC1_PERBV_bp = 0 ; Period Buffer Valid bit position

; TC1_CTRLGSET masks
; Masks for CCBBV aready defined
; Masks for CCABV aready defined
; Masks for PERBV aready defined

; TC1_INTFLAGS masks
.equ TC1_CCBIF_bm = 0x20 ; Compare or Capture B Interrupt Flag bit mask
.equ TC1_CCBIF_bp = 5 ; Compare or Capture B Interrupt Flag bit position
.equ TC1_CCAIF_bm = 0x10 ; Compare or Capture A Interrupt Flag bit mask
.equ TC1_CCAIF_bp = 4 ; Compare or Capture A Interrupt Flag bit position
.equ TC1_ERRIF_bm = 0x02 ; Error Interrupt Flag bit mask
.equ TC1_ERRIF_bp = 1 ; Error Interrupt Flag bit position
.equ TC1_OVFIF_bm = 0x01 ; Overflow Interrupt Flag bit mask
.equ TC1_OVFIF_bp = 0 ; Overflow Interrupt Flag bit position
 
