trol73/avr-make/asm/include/ATxmega64D4def.inc
; Clock Selection
.equ TC_CLKSEL_OFF_gc = (0x00<<0) ; Timer Off
.equ TC_CLKSEL_DIV1_gc = (0x01<<0) ; System Clock
.equ TC_CLKSEL_DIV2_gc = (0x02<<0) ; System Clock / 2
.equ TC_CLKSEL_DIV4_gc = (0x03<<0) ; System Clock / 4
.equ TC_CLKSEL_DIV8_gc = (0x04<<0) ; System Clock / 8
.equ TC_CLKSEL_DIV64_gc = (0x05<<0) ; System Clock / 64
.equ TC_CLKSEL_DIV256_gc = (0x06<<0) ; System Clock / 256
.equ TC_CLKSEL_DIV1024_gc = (0x07<<0) ; System Clock / 1024
.equ TC_CLKSEL_EVCH0_gc = (0x08<<0) ; Event Channel 0
.equ TC_CLKSEL_EVCH1_gc = (0x09<<0) ; Event Channel 1
.equ TC_CLKSEL_EVCH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC_CLKSEL_EVCH3_gc = (0x0B<<0) ; Event Channel 3

; Waveform Generation Mode
.equ TC_WGMODE_NORMAL_gc = (0x00<<0) ; Normal Mode
.equ TC_WGMODE_FRQ_gc = (0x01<<0) ; Frequency Generation Mode
.equ TC_WGMODE_SINGLESLOPE_gc = (0x03<<0) ; Single Slope
.equ TC_WGMODE_SS_gc = (0x03<<0) ; Single Slope
.equ TC_WGMODE_DSTOP_gc = (0x05<<0) ; Dual Slope, Update on TOP
.equ TC_WGMODE_DS_T_gc = (0x05<<0) ; Dual Slope, Update on TOP
.equ TC_WGMODE_DSBOTH_gc = (0x06<<0) ; Dual Slope, Update on both TOP and BOTTOM
.equ TC_WGMODE_DS_TB_gc = (0x06<<0) ; Dual Slope, Update on both TOP and BOTTOM
.equ TC_WGMODE_DSBOTTOM_gc = (0x07<<0) ; Dual Slope, Update on BOTTOM
.equ TC_WGMODE_DS_B_gc = (0x07<<0) ; Dual Slope, Update on BOTTOM

; Byte Mode
.equ TC_BYTEM_NORMAL_gc = (0x00<<0) ; 16-bit mode
.equ TC_BYTEM_BYTEMODE_gc = (0x01<<0) ; Timer/Counter operating in byte mode only
.equ TC_BYTEM_SPLITMODE_gc = (0x02<<0) ; Timer/Counter split into two 8-bit Counters (TC2)

; Event Action
.equ TC_EVACT_OFF_gc = (0x00<<5) ; No Event Action
.equ TC_EVACT_CAPT_gc = (0x01<<5) ; Input Capture
.equ TC_EVACT_UPDOWN_gc = (0x02<<5) ; Externally Controlled Up/Down Count
.equ TC_EVACT_QDEC_gc = (0x03<<5) ; Quadrature Decode
.equ TC_EVACT_RESTART_gc = (0x04<<5) ; Restart
.equ TC_EVACT_FRQ_gc = (0x05<<5) ; Frequency Capture
.equ TC_EVACT_PW_gc = (0x06<<5) ; Pulse-width Capture

; Event Selection
.equ TC_EVSEL_OFF_gc = (0x00<<0) ; No Event Source
.equ TC_EVSEL_CH0_gc = (0x08<<0) ; Event Channel 0
.equ TC_EVSEL_CH1_gc = (0x09<<0) ; Event Channel 1
.equ TC_EVSEL_CH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC_EVSEL_CH3_gc = (0x0B<<0) ; Event Channel 3

; Error Interrupt Level
.equ TC_ERRINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC_ERRINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC_ERRINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC_ERRINTLVL_HI_gc = (0x03<<2) ; High Level

; Overflow Interrupt Level
.equ TC_OVFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC_OVFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC_OVFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC_OVFINTLVL_HI_gc = (0x03<<0) ; High Level

; Compare or Capture D Interrupt Level
.equ TC_CCDINTLVL_OFF_gc = (0x00<<6) ; Interrupt Disabled
.equ TC_CCDINTLVL_LO_gc = (0x01<<6) ; Low Level
.equ TC_CCDINTLVL_MED_gc = (0x02<<6) ; Medium Level
.equ TC_CCDINTLVL_HI_gc = (0x03<<6) ; High Level

; Compare or Capture C Interrupt Level
.equ TC_CCCINTLVL_OFF_gc = (0x00<<4) ; Interrupt Disabled
.equ TC_CCCINTLVL_LO_gc = (0x01<<4) ; Low Level
.equ TC_CCCINTLVL_MED_gc = (0x02<<4) ; Medium Level
.equ TC_CCCINTLVL_HI_gc = (0x03<<4) ; High Level

; Compare or Capture B Interrupt Level
.equ TC_CCBINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC_CCBINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC_CCBINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC_CCBINTLVL_HI_gc = (0x03<<2) ; High Level

; Compare or Capture A Interrupt Level
.equ TC_CCAINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC_CCAINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC_CCAINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC_CCAINTLVL_HI_gc = (0x03<<0) ; High Level

; Timer/Counter Command
.equ TC_CMD_NONE_gc = (0x00<<2) ; No Command
.equ TC_CMD_UPDATE_gc = (0x01<<2) ; Force Update
.equ TC_CMD_RESTART_gc = (0x02<<2) ; Force Restart
.equ TC_CMD_RESET_gc = (0x03<<2) ; Force Hard Reset


;***************************************************************************
;** TC2 - 16-bit Timer/Counter type 2
;***************************************************************************/

; TC2_CTRLA masks
.equ TC2_CLKSEL_gm = 0x0F ; Clock Selection group mask
.equ TC2_CLKSEL_gp = 0 ; Clock Selection group position
.equ TC2_CLKSEL0_bm = (1<<0) ; Clock Selection bit 0 mask
.equ TC2_CLKSEL0_bp = 0 ; Clock Selection bit 0 position
.equ TC2_CLKSEL1_bm = (1<<1) ; Clock Selection bit 1 mask
.equ TC2_CLKSEL1_bp = 1 ; Clock Selection bit 1 position
.equ TC2_CLKSEL2_bm = (1<<2) ; Clock Selection bit 2 mask
.equ TC2_CLKSEL2_bp = 2 ; Clock Selection bit 2 position
.equ TC2_CLKSEL3_bm = (1<<3) ; Clock Selection bit 3 mask
.equ TC2_CLKSEL3_bp = 3 ; Clock Selection bit 3 position

; TC2_CTRLB masks
.equ TC2_HCMPDEN_bm = 0x80 ; High Byte Compare D Enable bit mask
.equ TC2_HCMPDEN_bp = 7 ; High Byte Compare D Enable bit position
.equ TC2_HCMPCEN_bm = 0x40 ; High Byte Compare C Enable bit mask
.equ TC2_HCMPCEN_bp = 6 ; High Byte Compare C Enable bit position
.equ TC2_HCMPBEN_bm = 0x20 ; High Byte Compare B Enable bit mask
.equ TC2_HCMPBEN_bp = 5 ; High Byte Compare B Enable bit position
.equ TC2_HCMPAEN_bm = 0x10 ; High Byte Compare A Enable bit mask
.equ TC2_HCMPAEN_bp = 4 ; High Byte Compare A Enable bit position
.equ TC2_LCMPDEN_bm = 0x08 ; Low Byte Compare D Enable bit mask
.equ TC2_LCMPDEN_bp = 3 ; Low Byte Compare D Enable bit position
.equ TC2_LCMPCEN_bm = 0x04 ; Low Byte Compare C Enable bit mask
.equ TC2_LCMPCEN_bp = 2 ; Low Byte Compare C Enable bit position
.equ TC2_LCMPBEN_bm = 0x02 ; Low Byte Compare B Enable bit mask
.equ TC2_LCMPBEN_bp = 1 ; Low Byte Compare B Enable bit position
.equ TC2_LCMPAEN_bm = 0x01 ; Low Byte Compare A Enable bit mask
.equ TC2_LCMPAEN_bp = 0 ; Low Byte Compare A Enable bit position

; TC2_CTRLC masks
.equ TC2_HCMPD_bm = 0x80 ; High Byte Compare D Output Value bit mask
.equ TC2_HCMPD_bp = 7 ; High Byte Compare D Output Value bit position
.equ TC2_HCMPC_bm = 0x40 ; High Byte Compare C Output Value bit mask
.equ TC2_HCMPC_bp = 6 ; High Byte Compare C Output Value bit position
.equ TC2_HCMPB_bm = 0x20 ; High Byte Compare B Output Value bit mask
.equ TC2_HCMPB_bp = 5 ; High Byte Compare B Output Value bit position
.equ TC2_HCMPA_bm = 0x10 ; High Byte Compare A Output Value bit mask
.equ TC2_HCMPA_bp = 4 ; High Byte Compare A Output Value bit position
.equ TC2_LCMPD_bm = 0x08 ; Low Byte Compare D Output Value bit mask
.equ TC2_LCMPD_bp = 3 ; Low Byte Compare D Output Value bit position
.equ TC2_LCMPC_bm = 0x04 ; Low Byte Compare C Output Value bit mask
.equ TC2_LCMPC_bp = 2 ; Low Byte Compare C Output Value bit position
.equ TC2_LCMPB_bm = 0x02 ; Low Byte Compare B Output Value bit mask
.equ TC2_LCMPB_bp = 1 ; Low Byte Compare B Output Value bit position
.equ TC2_LCMPA_bm = 0x01 ; Low Byte Compare A Output Value bit mask
.equ TC2_LCMPA_bp = 0 ; Low Byte Compare A Output Value bit position

