trol73/avr-make/asm/include/ATxmega64D4def.inc
; TC2_CTRLE masks
.equ TC2_BYTEM_gm = 0x03 ; Byte Mode group mask
.equ TC2_BYTEM_gp = 0 ; Byte Mode group position
.equ TC2_BYTEM0_bm = (1<<0) ; Byte Mode bit 0 mask
.equ TC2_BYTEM0_bp = 0 ; Byte Mode bit 0 position
.equ TC2_BYTEM1_bm = (1<<1) ; Byte Mode bit 1 mask
.equ TC2_BYTEM1_bp = 1 ; Byte Mode bit 1 position

; TC2_INTCTRLA masks
.equ TC2_HUNFINTLVL_gm = 0x0C ; High Byte Underflow Interrupt Level group mask
.equ TC2_HUNFINTLVL_gp = 2 ; High Byte Underflow Interrupt Level group position
.equ TC2_HUNFINTLVL0_bm = (1<<2) ; High Byte Underflow Interrupt Level bit 0 mask
.equ TC2_HUNFINTLVL0_bp = 2 ; High Byte Underflow Interrupt Level bit 0 position
.equ TC2_HUNFINTLVL1_bm = (1<<3) ; High Byte Underflow Interrupt Level bit 1 mask
.equ TC2_HUNFINTLVL1_bp = 3 ; High Byte Underflow Interrupt Level bit 1 position
.equ TC2_LUNFINTLVL_gm = 0x03 ; Low Byte Underflow interrupt level group mask
.equ TC2_LUNFINTLVL_gp = 0 ; Low Byte Underflow interrupt level group position
.equ TC2_LUNFINTLVL0_bm = (1<<0) ; Low Byte Underflow interrupt level bit 0 mask
.equ TC2_LUNFINTLVL0_bp = 0 ; Low Byte Underflow interrupt level bit 0 position
.equ TC2_LUNFINTLVL1_bm = (1<<1) ; Low Byte Underflow interrupt level bit 1 mask
.equ TC2_LUNFINTLVL1_bp = 1 ; Low Byte Underflow interrupt level bit 1 position

; TC2_INTCTRLB masks
.equ TC2_LCMPDINTLVL_gm = 0xC0 ; Low Byte Compare D Interrupt Level group mask
.equ TC2_LCMPDINTLVL_gp = 6 ; Low Byte Compare D Interrupt Level group position
.equ TC2_LCMPDINTLVL0_bm = (1<<6) ; Low Byte Compare D Interrupt Level bit 0 mask
.equ TC2_LCMPDINTLVL0_bp = 6 ; Low Byte Compare D Interrupt Level bit 0 position
.equ TC2_LCMPDINTLVL1_bm = (1<<7) ; Low Byte Compare D Interrupt Level bit 1 mask
.equ TC2_LCMPDINTLVL1_bp = 7 ; Low Byte Compare D Interrupt Level bit 1 position
.equ TC2_LCMPCINTLVL_gm = 0x30 ; Low Byte Compare C Interrupt Level group mask
.equ TC2_LCMPCINTLVL_gp = 4 ; Low Byte Compare C Interrupt Level group position
.equ TC2_LCMPCINTLVL0_bm = (1<<4) ; Low Byte Compare C Interrupt Level bit 0 mask
.equ TC2_LCMPCINTLVL0_bp = 4 ; Low Byte Compare C Interrupt Level bit 0 position
.equ TC2_LCMPCINTLVL1_bm = (1<<5) ; Low Byte Compare C Interrupt Level bit 1 mask
.equ TC2_LCMPCINTLVL1_bp = 5 ; Low Byte Compare C Interrupt Level bit 1 position
.equ TC2_LCMPBINTLVL_gm = 0x0C ; Low Byte Compare B Interrupt Level group mask
.equ TC2_LCMPBINTLVL_gp = 2 ; Low Byte Compare B Interrupt Level group position
.equ TC2_LCMPBINTLVL0_bm = (1<<2) ; Low Byte Compare B Interrupt Level bit 0 mask
.equ TC2_LCMPBINTLVL0_bp = 2 ; Low Byte Compare B Interrupt Level bit 0 position
.equ TC2_LCMPBINTLVL1_bm = (1<<3) ; Low Byte Compare B Interrupt Level bit 1 mask
.equ TC2_LCMPBINTLVL1_bp = 3 ; Low Byte Compare B Interrupt Level bit 1 position
.equ TC2_LCMPAINTLVL_gm = 0x03 ; Low Byte Compare A Interrupt Level group mask
.equ TC2_LCMPAINTLVL_gp = 0 ; Low Byte Compare A Interrupt Level group position
.equ TC2_LCMPAINTLVL0_bm = (1<<0) ; Low Byte Compare A Interrupt Level bit 0 mask
.equ TC2_LCMPAINTLVL0_bp = 0 ; Low Byte Compare A Interrupt Level bit 0 position
.equ TC2_LCMPAINTLVL1_bm = (1<<1) ; Low Byte Compare A Interrupt Level bit 1 mask
.equ TC2_LCMPAINTLVL1_bp = 1 ; Low Byte Compare A Interrupt Level bit 1 position

; TC2_CTRLF masks
.equ TC2_CMD_gm = 0x0C ; Command group mask
.equ TC2_CMD_gp = 2 ; Command group position
.equ TC2_CMD0_bm = (1<<2) ; Command bit 0 mask
.equ TC2_CMD0_bp = 2 ; Command bit 0 position
.equ TC2_CMD1_bm = (1<<3) ; Command bit 1 mask
.equ TC2_CMD1_bp = 3 ; Command bit 1 position
.equ TC2_CMDEN_gm = 0x03 ; Command Enable group mask
.equ TC2_CMDEN_gp = 0 ; Command Enable group position
.equ TC2_CMDEN0_bm = (1<<0) ; Command Enable bit 0 mask
.equ TC2_CMDEN0_bp = 0 ; Command Enable bit 0 position
.equ TC2_CMDEN1_bm = (1<<1) ; Command Enable bit 1 mask
.equ TC2_CMDEN1_bp = 1 ; Command Enable bit 1 position

; TC2_INTFLAGS masks
.equ TC2_LCMPDIF_bm = 0x80 ; Low Byte Compare D Interrupt Flag bit mask
.equ TC2_LCMPDIF_bp = 7 ; Low Byte Compare D Interrupt Flag bit position
.equ TC2_LCMPCIF_bm = 0x40 ; Low Byte Compare C Interrupt Flag bit mask
.equ TC2_LCMPCIF_bp = 6 ; Low Byte Compare C Interrupt Flag bit position
.equ TC2_LCMPBIF_bm = 0x20 ; Low Byte Compare B Interrupt Flag bit mask
.equ TC2_LCMPBIF_bp = 5 ; Low Byte Compare B Interrupt Flag bit position
.equ TC2_LCMPAIF_bm = 0x10 ; Low Byte Compare A Interrupt Flag bit mask
.equ TC2_LCMPAIF_bp = 4 ; Low Byte Compare A Interrupt Flag bit position
.equ TC2_HUNFIF_bm = 0x02 ; High Byte Underflow Interrupt Flag bit mask
.equ TC2_HUNFIF_bp = 1 ; High Byte Underflow Interrupt Flag bit position
.equ TC2_LUNFIF_bm = 0x01 ; Low Byte Underflow Interrupt Flag bit mask
.equ TC2_LUNFIF_bp = 0 ; Low Byte Underflow Interrupt Flag bit position
 
; Clock Selection
.equ TC2_CLKSEL_OFF_gc = (0x00<<0) ; Timer Off
.equ TC2_CLKSEL_DIV1_gc = (0x01<<0) ; System Clock
.equ TC2_CLKSEL_DIV2_gc = (0x02<<0) ; System Clock / 2
.equ TC2_CLKSEL_DIV4_gc = (0x03<<0) ; System Clock / 4
.equ TC2_CLKSEL_DIV8_gc = (0x04<<0) ; System Clock / 8
.equ TC2_CLKSEL_DIV64_gc = (0x05<<0) ; System Clock / 64
.equ TC2_CLKSEL_DIV256_gc = (0x06<<0) ; System Clock / 256
.equ TC2_CLKSEL_DIV1024_gc = (0x07<<0) ; System Clock / 1024
.equ TC2_CLKSEL_EVCH0_gc = (0x08<<0) ; Event Channel 0
.equ TC2_CLKSEL_EVCH1_gc = (0x09<<0) ; Event Channel 1
.equ TC2_CLKSEL_EVCH2_gc = (0x0A<<0) ; Event Channel 2
.equ TC2_CLKSEL_EVCH3_gc = (0x0B<<0) ; Event Channel 3

; Byte Mode
.equ TC2_BYTEM_NORMAL_gc = (0x00<<0) ; 16-bit mode
.equ TC2_BYTEM_BYTEMODE_gc = (0x01<<0) ; Timer/Counter operating in byte mode only (TC2)
.equ TC2_BYTEM_SPLITMODE_gc = (0x02<<0) ; Timer/Counter split into two 8-bit Counters

; High Byte Underflow Interrupt Level
.equ TC2_HUNFINTLVL_OFF_gc = (0x00<<2) ; Interrupt Disabled
.equ TC2_HUNFINTLVL_LO_gc = (0x01<<2) ; Low Level
.equ TC2_HUNFINTLVL_MED_gc = (0x02<<2) ; Medium Level
.equ TC2_HUNFINTLVL_HI_gc = (0x03<<2) ; High Level

; Low Byte Underflow Interrupt Level
.equ TC2_LUNFINTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ TC2_LUNFINTLVL_LO_gc = (0x01<<0) ; Low Level
.equ TC2_LUNFINTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ TC2_LUNFINTLVL_HI_gc = (0x03<<0) ; High Level

